[
  {
    "username": "Footiespr5687",
    "hashtag": "#PAFC",
    "comment": "Plymouth vs QPR The Pilgrims fans need something to cheer after two uninspiring defeats so far . Qpr have not lost on the last 2 trips to Home Park and will fancy making it 3 Prediction = 0-2 #pafc #QPR"
  },
  {
    "username": "NathanPear46785",
    "hashtag": "#PAFC",
    "comment": "Tonight's game is a must win #pafc"
  },
  {
    "username": "Ben48037650",
    "hashtag": "#PAFC",
    "comment": "What kind of plug? #pafc"
  },
  {
    "username": "DavideTieghi",
    "hashtag": "#HOOPS",
    "comment": "#Hoops #PAFC vs. #QPR Two previous meetings in the League Cup: November 20, 1973: 0-3 At Loftus Road September 5, 2020: 2-3 At Home Park #CarabaoCup"
  },
  {
    "username": "StuartHill1979",
    "hashtag": "#PAFC",
    "comment": "Every time Arygle nearly sign a player , Simon Hallet #pafc"
  },
  {
    "username": "NathanPear46785",
    "hashtag": "#PAFC",
    "comment": "Hi @grok how much longer do we have to wait until Pleggy and Hazard are back? #pafc"
  },
  {
    "username": "markyball",
    "hashtag": "#PAFC",
    "comment": "I’m presuming at this stage that we’ve simply forgotten to communicate we’re under transfer embargo #pafc"
  },
  {
    "username": "jm_bell95",
    "hashtag": "#PAFC",
    "comment": "- “A lot of reflection is needed and has been called for by Tom Cleverley. The Pilgrims have to shake their soft attitude in games that when the going gets tough, they fold.” It’s already tough for Argyle, here’s my take on Saturday #pafc"
  },
  {
    "username": "Kashima_KMOT",
    "hashtag": "#PAFC",
    "comment": "#pafc Have argyle given up on signing players????"
  },
  {
    "username": "TimCotton81",
    "hashtag": "#PAFC",
    "comment": "Argyle not being able to sign anyone is incredibly odd! Just don’t get it at all. How do you go over a month in the summer without making a signing when squad is so light? #pafc"
  },
  {
    "username": "TomJP7",
    "hashtag": "#PAFC",
    "comment": "Come on @Argyle have a look in the bargain bucket! #pafc"
  },
  {
    "username": "FatJanner",
    "hashtag": "#PAFC",
    "comment": "At this point argyle should offer them all a 6 month contract #pafc"
  },
  {
    "username": "YeovilVoter",
    "hashtag": "#PAFC",
    "comment": "To be fair Cleverly cannot be completely omitted from blame. Palsson at CB in a back 4 leaks goals. We all know this. No reason why that starting 11 couldn't line up 3-5-2 or 3-4-3 or something equivalent. #pafc"
  },
  {
    "username": "SHD_Backup",
    "hashtag": "#BCAFC",
    "comment": "NEW MoreSHD VIDEO OUT NOW! *TENNAI WATSON, GEORGE ABBOTT, MALCOLM EBIOWEI + MORE! | League One Transfer Roundup Week 9* Watch Here https://youtu.be/Tx2sN8XV8CY?si=5NQxtnP0nPhfKDq1… Can We Hit 120 Likes? +Appreciated #BCAFC #DRFC #AFCW #PVFC #HTAFC #BWFC #PAFC #MTFC #LOFC #LTFC #PUFC #Soccer"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "\"It's an important game for us to win and change the narrative right now but we can't afford to lose any more bodies.\" Tom Cleverley on Argyle's Carabao Cup first round tie against QPR at Home Park tomorrow night. #pafc"
  },
  {
    "username": "FatJanner",
    "hashtag": "#PAFC",
    "comment": "If we dont sign 3+ by Saturday then they need to unfortunately do what they dont want to do. Offer more than a team in a better location and give the players release clauses. As much as i hate them and understand the new approach it wont help if we get relegated #pafc"
  },
  {
    "username": "awaydayladsfs",
    "hashtag": "#GREENARMY",
    "comment": "Plymouth fan taking it well from the bolton fans #greenarmy #Plymouth #pafc #Bolton #bwfc #league1 #efl #Englishbanter #footballchants"
  },
  {
    "username": "awaydayladsfs",
    "hashtag": "#GREENARMY",
    "comment": "Plymouth fan taking it well from the bolton fans #greenarmy #Plymouth #pafc #Bolton #bwfc #league1 #efl #Englishbanter #footballchants"
  },
  {
    "username": "Neilpafc",
    "hashtag": "#PAFC",
    "comment": "While we love Foxy and appreciate his efforts to help the club and guide us in the right direction, I believe he’s slightly out of his depth. Do you agree? Dewsnip, on the other hand, has more experience is that fair to say? #pafc #coyg #argyle"
  },
  {
    "username": "AdamFell9",
    "hashtag": "#PAFC",
    "comment": "#pafc Couldn’t give a flying fuck if he used to play for Exeter,I’d be all over Blackman would be miles better than Ashby Hammond,even that Archie mair would be better"
  },
  {
    "username": "StevieWotsa",
    "hashtag": "#PAFC",
    "comment": "Would love him back tbh still love him #pafc"
  },
  {
    "username": "PodcastChickens",
    "hashtag": "#SKYBETLEAGUEONE",
    "comment": "#skybetleagueone #afcw #BarnsleyFC #UTMP #BWFC #BAFC #CityAsOne #Bluebirds #CardiffCity #drfc #ECFC #SemperFidelis #HTAFC #LOFC #OneOrient #Imps #LTFC #COYH #Stags #MTFC #ShoeArmy #PUFC #PAFC #PVFC #ReadingFC #RUFC #TownCountyUnited #StevenageFC #ThisIsMyCounty"
  },
  {
    "username": "kenadams777",
    "hashtag": "#BREAKEVENFC",
    "comment": "Agree with this. Also complete discord between players and fans. Bar Edwards, no real characters. Players going through the motions. HP will turn toxic very, very quickly. Sad times #breakevenFC #pafc"
  },
  {
    "username": "TQ_Pilgrim",
    "hashtag": "#PAFC",
    "comment": "I feel good about the fifth name on that list #pafc"
  },
  {
    "username": "plymrrf",
    "hashtag": "#PAFC",
    "comment": "Waiting for any sort of news #pafc"
  },
  {
    "username": "ChiIdishDanbino",
    "hashtag": "#PAFC",
    "comment": "Reckon they replace him within the week with a proven goal scorer #pafc"
  },
  {
    "username": "RossColeman91",
    "hashtag": "#PAFC",
    "comment": "Still nothing..... can't wait for Lincoln away said nobody ever #pafc"
  },
  {
    "username": "ArgyleMemes",
    "hashtag": "#PAFC",
    "comment": "Tom Randle at 2359 on the 31st of August speaking to a one legged Striker in the fourth tier of the Latvian football pyramid. #PAFC"
  },
  {
    "username": "pdemmett",
    "hashtag": "#PAFC",
    "comment": "The argyle board Assisting fucking 3 points #pafc"
  },
  {
    "username": "jm_bell95",
    "hashtag": "#PAFC",
    "comment": "Where do you see #pafc just now Gab? Plenty of discourse in the city about the state of affairs, what’s a neutrals view?"
  },
  {
    "username": "Scudda85",
    "hashtag": "#PAFC",
    "comment": "Hmmm....how many of these are we signing then? . #pafc"
  },
  {
    "username": "chapperslfc14",
    "hashtag": "#PAFC",
    "comment": "Some players would improve the squad easy #pafc"
  },
  {
    "username": "talkSPORT2",
    "hashtag": "#EFL",
    "comment": "NOW: EFL All Access Podcast! @HughWoozencroft and Cameron Jerome bring you the big stories from the #EFL Bristol City stun #SUFC Millwall for the Play-Offs? @ChrisErrington1 on #pafc @takesthatchance on Lee Grant's start! More! Listen"
  },
  {
    "username": "LeagueOne25",
    "hashtag": "#AFCW",
    "comment": "Current Free Agents Would you take any of these at your club? #AFCW #BarnsleyFC #UTMP #bwfc #BCAFC #bafc #CardiffCity #DRFC #ecfc #htafc #LOFC #OneOrient #WeAreImps #LTFC #mtfc #Stags #ntfc #ShoeArmy #pufc #pafc #pvfc #ReadingFC #rufc #StockportCounty #wafc #Chairboys"
  },
  {
    "username": "PilgrimPetey",
    "hashtag": "#PAFC",
    "comment": "Absolute bloody mess going into week 3!! So we signed a trialist keeper who played about 20 odd minutes in league 2 last season! Only 1 LB who’s been injured since pre season with no competition! Kept the same CB’s who were diabolical under Rooney! Still no number 9!! #pafc"
  },
  {
    "username": "Army61Green",
    "hashtag": "#PAFC",
    "comment": "#pafc oh well, that’s another L1 club with £2.5M to spend…onto Plan H,I, J!!!"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "\"His game understanding, his quality, his versatility, I think we have got real good strengths in Ayman and he will play on Tuesday.\" Tom Cleverley is set to give Ayman Benarous a full debut for Argyle against QPR in the Carabao Cup, Read More: #pafc"
  },
  {
    "username": "Dezzi_Searle",
    "hashtag": "#PAFC",
    "comment": "First I’ve read of it? #pafc"
  },
  {
    "username": "luketalkssport",
    "hashtag": "#CARDIFFCITY",
    "comment": "In Case You Missed It! Ranking L1 Graphic Suites #cardiffcity #bcafc #drfc #afcw #pvfc #barnsleyfc #bwfc #bafc #ntfc #mtfc #pafc #ltfc #hatters #wwfc #lofc #blackpoolfc #imps #hcafc #rufc #wafc #stevenagefc #ecfc #pufc #royals"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "Argyle have lost almost half of their 72 league games since Steven Schumacher left the club in December 2023. That indicates the size of the task facing Tom Cleverley at the start of his tenure as head coach. Read More: #pafc"
  },
  {
    "username": "riceypafc7",
    "hashtag": "#PAFC",
    "comment": "Actually wonder when there will be anything positive coming out of #pafc. I’ve forgot what it feels like to have a good feeling"
  },
  {
    "username": "TomHarris_PLYM",
    "hashtag": "#PAFC",
    "comment": "If you listen to anything today tune into 37 minutes in to the latest @ArgyleLife1886 pod. @Adam_Price17 really hitting the nail on the head of the general consensus of fans at the moment #pafc"
  },
  {
    "username": "paulGf185",
    "hashtag": "#PAFC",
    "comment": "South wales to Coventry to watch #pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "NEWS: Left-back Nathanel Ogbeta started for Barnsley on Saturday in their 3-2 home win against Burton Albion in his first game on loan at the league one club! He also played the full 90 minutes! #pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "NEWS: Callum Wright made his debut for Wigan Athletic on loan from argyle on Saturday as a half-time substitute in a 2-0 defeat away to Leyton Orient! #pafc"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "An Argyle loan round-up featuring Jack Matthews, Nathanael Ogbeta and Callum Wright. Read More: #pafc"
  },
  {
    "username": "joshcraven_",
    "hashtag": "#PAFC",
    "comment": "nice one burrell #pafc"
  },
  {
    "username": "AlfredGREENWOO9",
    "hashtag": "#PAFC",
    "comment": "Loan offer for Burrell? #pafc"
  },
  {
    "username": "llewellyn2705",
    "hashtag": "#PAFC",
    "comment": "Surely this makes me insane? Only missed 2 or 3 of those #pafc"
  },
  {
    "username": "ArgyleBoyo",
    "hashtag": "#PAFC",
    "comment": "Didn’t even need burrell #pafc"
  },
  {
    "username": "Ollie_PAFC",
    "hashtag": "#PAFC",
    "comment": "Luca when anyone on the pitch shoots (including our own player) #pafc"
  },
  {
    "username": "TomHarris_PLYM",
    "hashtag": "#PAFC",
    "comment": "Can’t begin to imagine the state of #pafc if Wycombe sell Kone to QPR and bring in a striker before Argyle do…"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "\"I thought he showed good attributes and gives us another option at centre-back.\" Tom Cleverley on Brendan Wiredu's appearance as a second half substitute for Argyle against Bolton. Read More: #pafc"
  },
  {
    "username": "medfootix",
    "hashtag": "#PAFC",
    "comment": "Important update: Tomorrow night’s Carabao Cup tie between Plymouth and QPR won’t be available to watch on Argyle TV due to competition rules. #PAFC #QPR #CarabaoCup #PlymouthVsQPR"
  },
  {
    "username": "Ollie_Haggart",
    "hashtag": "#PAFC",
    "comment": "Interesting to note the availability of tickets here. 12,058 attended the first round match last season vs Cheltenham (a lower league team), looking at the stadium plan for this year, a considerable number of tickets remained unsold. Another sign things are far from well? #pafc"
  },
  {
    "username": "PaFcZOOCORNER",
    "hashtag": "#PAFC",
    "comment": "My team for tomorrow time to mix things up I think if we lose we lose #pafc"
  },
  {
    "username": "TomSleeman",
    "hashtag": "#PAFC",
    "comment": "The longer this forward saga drags on the more inevitable it is that we'll just sign someone like Britt Assombalonga as a free agent on deadline day. #pafc"
  },
  {
    "username": "Jakfirst",
    "hashtag": "#PAFC",
    "comment": "The saddest thing about the mess at Argyle at the moment (and over the last 18 months) is that I’m actually not even angry about it anymore. I just feel flat. Feel like the passion has been totally beaten out of me. Hopefully we find a spark to reignite it again soon. #pafc"
  },
  {
    "username": "strace42",
    "hashtag": "#PAFC",
    "comment": "Risk Taking FC has been taken over by Penny Pinch FC At least Foulston Park will look good Don't criticise His Royal Highness Uncle Simon or the Happy Clappers will mention that we have a club and be grateful. Has anyone seen our ambition #pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "TEAM NEWS: 22 year old Ayman Benarous is set to start when Argyle take on Queens Park Rangers in the Carabao Cup first round at Home Park tomorrow night! #pafc"
  },
  {
    "username": "RobShanahan27",
    "hashtag": "#PAFC",
    "comment": "Can we please have a signing before Lincoln. It’s getting depressing now #pafc"
  },
  {
    "username": "jackolesliepafc",
    "hashtag": "#PAFC",
    "comment": "If you are brave enough. It’s being shown on Sky Sports plus tomorrow. #pafc https://skysports.com/football/plymouth-argyle-vs-queens-park-rangers/534895…"
  },
  {
    "username": "Ryanhiggins1992",
    "hashtag": "#PAFC",
    "comment": "Just get back scarr and gillesphey in defence #pafc"
  },
  {
    "username": "deanball__",
    "hashtag": "#PAFC",
    "comment": "Not being included in the squad at Kiel. Change to a back 5, play Mackenzie as a LCB when he’s fit again to keep Galloway out of the squad and bring him back on loan. Definitely has potential and at least he offers passion #PAFC"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "Ayman Benarous is set to start a competitive match for the first time in more than three years when Argyle take on Queens Park Rangers in the Carabao Cup first round at Home Park tomorrow night. Read More: #pafc"
  },
  {
    "username": "edsmith1989",
    "hashtag": "#PAFC",
    "comment": "Personally id like to see a permanent number 9 and a CB. Then the return of Loan FC to add some quality and depth #pafc"
  },
  {
    "username": "CornishArgyle",
    "hashtag": "#PAFC",
    "comment": "The board need to back Cleverley ffs, tactically outclassed by Schuey. Fuming. No way we're going up sadly unless we sign some players in both this window & in January, hopefully it'll all be better as it is early days #pafc see you all at Lincoln"
  },
  {
    "username": "ArgyleBoyo",
    "hashtag": "#PAFC",
    "comment": "Argyle admins when it’s not going very well but they need to post #pafc"
  },
  {
    "username": "ConnorArgyle99",
    "hashtag": "#PAFC",
    "comment": "Where do we genuinely end the season with this lack of business#pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "NEWS: Plymouth-based business Arch Fire Systems will be argyle’s sleeve sponsor for tomorrow’s Carabao Cup tie against QPR! #pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "NEWS: 19-year-old defender Jack Matthews joined Bath City on loan but was an unused substitute in their 1-1 season opening draw away to Worthing in National League South! #pafc | #Romans"
  },
  {
    "username": "jm_bell95",
    "hashtag": "#PAFC",
    "comment": "What on earth is this? David Fox - is in Plymouth and is our head of football operations, not at Huddersfield. If people have issues that’s fine but this is just nonsense before I even move onto the other two Individuals #pafc"
  },
  {
    "username": "Ben48037650",
    "hashtag": "#PAFC",
    "comment": "Argyles current senior management David Fox - Huddersfield’s loan manager Tom Randle - not in Plymouth Stuart Webber - not in Plymouth #pafc"
  },
  {
    "username": "Army61Green",
    "hashtag": "#PAFC",
    "comment": "#pafc It’s now been clarified that we were never in for Jamie Vardy, but we have made great progress in talks with Reg Varney! We can meet his wage demands providing he drives the team bus - and we can bring him back to life!"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "Argyle's 19-year-old defender Jack Matthews began a loan spell at Bath City as an unused substitute in their 1-1 season-opening draw away to Worthing in National League South. Read More: #pafc"
  },
  {
    "username": "TheCrazyPilgrim",
    "hashtag": "#PAFC",
    "comment": "Go take a listen #pafc"
  },
  {
    "username": "jm_bell95",
    "hashtag": "#PAFC",
    "comment": "If there is one, doesn’t look like it’ll be on Argyle TV with the latest tweet that’s been put out #pafc"
  },
  {
    "username": "max17527",
    "hashtag": "#PAFC",
    "comment": "#pafc anyone that can offer a spare ticket for Cardiff away?"
  },
  {
    "username": "TomHarris_PLYM",
    "hashtag": "#PAFC",
    "comment": "Anyone know if there’s a press conference today ahead of the cup match tomorrow? #pafc"
  },
  {
    "username": "ChattingArgyle",
    "hashtag": "#PAFC",
    "comment": "Just laughing to myself how Hallett said we’d finish 2nd there is no way he watches football on the regular man wtf#pafc"
  },
  {
    "username": "GynnHerbie",
    "hashtag": "#PAFC",
    "comment": "Absolute meltdown tomorrow regardless how Burrell plays against us. If he plays well we’ll all say “why couldn’t we get him” if he’s bad it’ll be “why did we spend so long trying to get him” Meltdown definitely pending, very justified though in my opinion. #pafc"
  },
  {
    "username": "drew_peanutz",
    "hashtag": "#PAFC",
    "comment": "Surely it’s time for Argyle to look abroad for a striker. Seems we’ve tried just about every single English club from championship to national league to see if they’ll sell us a striker and failed. Got to be some gems in some of the other countries #pafc"
  },
  {
    "username": "avo14ross",
    "hashtag": "#PAFC",
    "comment": "#pafc"
  },
  {
    "username": "Ollie_PAFC",
    "hashtag": "#PAFC",
    "comment": "The issue is we’re shit, no one wants to watch the shit on the pitch. We’d rather watch grass grow #pafc"
  },
  {
    "username": "Ollie_PAFC",
    "hashtag": "#PAFC",
    "comment": "As soon as we started singing palsson’s song against Barnsley he’s been shite #pafc"
  },
  {
    "username": "Ewan2469",
    "hashtag": "#PAFC",
    "comment": "Can they play as number 9 #pafc"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "Tom Cleverley has talked about building a winning culture at Argyle but on the evidence of the first two games of the 2025/26 season that is not going to be achieved quickly. Read More: #pafc"
  },
  {
    "username": "PAFCAcademy",
    "hashtag": "#PAFC",
    "comment": "Argyle suffered an opening-day EFL Youth Alliance League South defeat to Luton Town on Saturday morning, losing 5-1 away from home. Report: #pafc"
  },
  {
    "username": "LewisAtherton99",
    "hashtag": "#PAFC",
    "comment": "Plan F revealed #pafc"
  },
  {
    "username": "ArgyleMemes",
    "hashtag": "#PAFC",
    "comment": "Great timing... We need to extinguish a few fires. #PAFC"
  },
  {
    "username": "DevonportDanny",
    "hashtag": "#PAFC",
    "comment": "Just as our hope for the season are extinguished. #PAFC"
  },
  {
    "username": "LeagueOne25",
    "hashtag": "#SKYBETLEAGUEONE",
    "comment": "How do you feel when you see this #SkyBetLeagueOne table on this Monday morning? #AFCW #BarnsleyFC #UTMP #bwfc #BCAFC #BAFC #CardiffCity #DRFC #ecfc #htafc #LOFC #WeAreImps #LTFC #mtfc #ntfc #pufc #pafc #pvfc #ReadingFC #rufc #StevenageFC #StockportCounty #wafc #Chairboys"
  },
  {
    "username": "Ollie_PAFC",
    "hashtag": "#PAFC",
    "comment": "Day 2 of posting a randomly AI generated photo until argyle win a game #pafc"
  },
  {
    "username": "kenadams777",
    "hashtag": "#PAFC",
    "comment": "Imagine being a prospective player knowing you are Plan D E F.... hardly a big draw is it #pafc #shambles"
  },
  {
    "username": "FIWCHAMP09",
    "hashtag": "#PAFC",
    "comment": "Hopefully Hallett Fox and Randle all had a meeting after Saturday even if it's by zoom, If not we are the worse run club in the country, Miles behind everyone else not a single loan player in either. #pafc"
  },
  {
    "username": "bbcdevonsport",
    "hashtag": "#PAFC",
    "comment": "Plymouth Argyle are without a win so far this season. Boss Tom Cleverley says during tough times he has to ‘work harder’ and ‘look in the mirror first.’ Read more: #pafc"
  },
  {
    "username": "TheHubFoulston",
    "hashtag": "#PAFC",
    "comment": "The morning session was so nice, we had to do it all over again Check out the action from the afternoon session (more on our Facebook page) #pafc #TheHubFoulston #ArgyleAcademy"
  },
  {
    "username": "Callum_Foy7",
    "hashtag": "#PAFC",
    "comment": "‘Need to address that quickly’ – Tom Cleverley makes ‘mentality’ admission after Plymouth Argyle’s defeat to Bolton Wanderers #PAFC #BWFC @_The72"
  },
  {
    "username": "DanCook5",
    "hashtag": "#PAFC",
    "comment": "No idea why we bother but that’s Cardiff away sorted with the old man #pafc"
  },
  {
    "username": "ChrisErrington1",
    "hashtag": "#PAFC",
    "comment": "Tom Cleverley thought Brendan Wiredu took 'a forward step' with his performance as a second half substitute in Argyle's 2-0 defeat by Bolton . Read More: #pafc"
  },
  {
    "username": "Block9Podcast",
    "hashtag": "#PAFC",
    "comment": "#pafc"
  },
  {
    "username": "Aaronpress1",
    "hashtag": "#PAFC",
    "comment": "The ticketing website is as neglected as the first team #pafc"
  },
  {
    "username": "PAFCHelp",
    "hashtag": "#PAFC",
    "comment": "We are aware of an issue that is stopping supporters from purchasing tickets this morning. This is being worked on now, and we will look to provide an update as soon as possible. We're sorry for any inconvenience caused. #pafc"
  },
  {
    "username": "pafctom97",
    "hashtag": "#PAFC",
    "comment": "Not sure why I've done it but guess I'm going Cardiff away now. #pafc"
  },
  {
    "username": "joshhaynesPAFC",
    "hashtag": "#PAFC",
    "comment": "Cardiff tickets secured. Not sure why I do it to myself. #PAFC"
  },
  {
    "username": "pafc_brad",
    "hashtag": "#PAFC",
    "comment": "If there is no signings this week then that’s honestly pathetic. Club have had over a month now to get some business done #pafc"
  },
  {
    "username": "Neilpafc",
    "hashtag": "#PAFC",
    "comment": "Just trying to figure out what name we should be called Tinpot FC or Breakeven FC difficult one #pafc #coyg"
  },
  {
    "username": "ParamedicEm",
    "hashtag": "#PAFC",
    "comment": "Feeling a bit disheartened today. Hoping for some realistic updates and some sniff of new players this week #pafc"
  },
  {
    "username": "markyball",
    "hashtag": "#PAFC",
    "comment": "Appreciate our needs appear lengthy already, but could we add a couple of strength and conditioning coaches to the list please. We’ve got the physio’s to treat the injuries, but nobody to mitigate them in the first place. #pafc"
  },
  {
    "username": "Scudda85",
    "hashtag": "#PAFC",
    "comment": "@Argyle ....can we sign a few more players today, please!? #pafc"
  },
  {
    "username": "PAFCNewsHub",
    "hashtag": "#PAFC",
    "comment": "Plymouth Argyle v QPR Our first cup game of the new season. My match preview is now live on Substack! Read Below! #pafc #QPR https://substack.com/@argylenewshub/note/p-170668337?r=5prsbg&utm_medium=ios&utm_source=notes-share-action…"
  },
  {
    "username": "pickles18862",
    "hashtag": "#PAFC",
    "comment": "right - hope the board watched saturday’s game, squad is paper thin - we need some players in asap minimum need of 2 strikers. 2 creative midfielders and commanding defenders #Pafc"
  },
  {
    "username": "joshcraven_",
    "hashtag": "#PAFC",
    "comment": "Need some signings this week pronto if we want any chance of doing well this season. think bolton showed we have more holes. still think we need another 5-6 to be honest #pafc"
  },
  {
    "username": "joshcraven_",
    "hashtag": "#PAFC",
    "comment": "You’ve spent over £200m, and you’re still worried. my club can’t even reach a million pounds spent in one window #pafc"
  },
  {
    "username": "hzm1987",
    "hashtag": "#PAFC",
    "comment": "Our biggest asset is the men’s first team…. This is where the money needs to go #pafc"
  },
  {
    "username": "PLsportsnews",
    "hashtag": "#ARGYLE",
    "comment": "ONLY 1 #ARGYLE and only 1 day until the greens host #QPR in the #EFLCup (League Cup) at home from Home Park after back to back opening league defeats... your thoughts #GreenArmy? #TC #PAFC"
  },
  {
    "username": "Army61Green",
    "hashtag": "#PAFC",
    "comment": "#pafc and TC’s words that we don’t have the budget of some of the other clubs in the league, can only relate to 5 other clubs if we’ve been told the truth. Fact is, the current playing budget must be massively underspent, whatever it is!!"
  },
  {
    "username": "LeagueOne25",
    "hashtag": "#AFCW",
    "comment": "There are different crests in the 3rd tier Who has the best badge in SkyBetLeagueOne? Who has the worst badge in SkyBetLeagueOne? #AFCW #BarnsleyFC #UTMP #bwfc #BCAFC #CardiffCity #DRFC #ecfc #htafc #LOFC #LTFC #mtfc #ntfc #pufc #pafc #ReadingFC #rufc #StockportCounty #wafc"
  },
  {
    "username": "danPAFC5",
    "hashtag": "#PAFC",
    "comment": "Today is the day #pafc"
  },
  {
    "username": "bpfootball",
    "hashtag": "#BARNETFC",
    "comment": "Fleetwood Town - Promise, Will and Wild (by @jeffweston1970 ) #BarnetFC #OnwardTogether #PAFC #BRFC #BWFC"
  },
  {
    "username": "Army61Green",
    "hashtag": "#PAFC",
    "comment": "#pafc talk of a significant bid’ suggests that it’s not Cole. On the bench Saturday and says wants to fight for his place. But given he was a free and has 10 months left, believed offers of c£250K would be accepted. Should be in for him anyway - proven and 1 isn’t enough!"
  },
  {
    "username": "ArgyleMemes",
    "hashtag": "#PAFC",
    "comment": "Pure Poetry. #PAFC"
  },
  {
    "username": "Block9Podcast",
    "hashtag": "#PAFC",
    "comment": "Thank you, Ian, for your kind words. Always happy to welcome opposition fans on board #pafc"
  }
]